{
    "blogs": [
        {
            "title": "A Little Hope and Encouragement for Hard Times",
            "body": "'If your path demands you to walk through hell, walk as though you own the place.' ~Unknown\n\nTrigger warning: This content contains references to self-harm and suicide.\n\nIt was in the spring semester during graduate school. I was living alone in a one-bedroom apartment and working nearly full-time hours at night.\n\nThe anti-depressants were not working so well. I was keeping up with my therapist, but I suppose it was too much.\n\nI felt too much. It hurt so much and could not handle it. You could list out the symptoms of depression, and I had them all.\n\nUnable to deal with the stress of college, broken relationships, or other life events, any added stressor seemed unbearable. I cried a lot, had terrible neck pain, and even failed one of my classes.\n\nI would hurt myself more with wild hope that the physical pain would outweigh the emotional. It was a low point at the bottom of the pendulum swing.\n\nWhen I began to feel like eternal sleep was the only peace in sight, I turned myself in by telling my therapist exactly what I was planning to do. They wasted no time and had me in safe hands quickly.\n\nThat was the second time I went to the mental hospital within a year. I stayed in my room mostly and cried a lot, but the staff were kind and helpful.\n\nMy psychiatrist was concerned about the underlying cause. He eventually landed on clinical depression and general anxiety disorder. After a three-day stay and medication adjustment, I was released.\n\nOver the next while, I did well enough. Eventually finishing my graduate degree had a positive effect on my chronic migraines.\n\nI would had multiple treatments to ease the headaches. Once a migraine attack lasted for two weeks. When they suddenly eased, my doctor basically shrugged and attributed them to stress.\n\nAbout a year later, I had a new therapist and psychiatrist. Finally, I was diagnosed with treatment-resistant depression, general anxiety disorder, and borderline personality disorder.\n\nIt explained why I had been through so many medication adjustments, the bouts of insomnia, and the frequent mood swings. I believe that simply having some answers helped.\n\nMy medication was adjusted again, and I began to feel much better. There was no more self-harming, and I grew my support group. I am with the same therapist and on the same medication several years later.\n\nDuring all of this, I changed jobs twice, lost a mentor to COVID, and moved to a new house. There were also things going on in my family that were out of my control.\n\nWhat was obvious was that I was able to cope with life events much better than before. I learned to adopt a lot of tools to help combat old habits.\n\nFor example, instead of freaking out over a situation, I could take a moment and meditate if able. I was able to considerably lower my stress and anxiety this way.\n\nInstead of isolating after a rejection, I could seek out a close friend to talk to or go out with. To help me stop thinking negative thoughts about myself, I would write positive things on sticky notes and place them around the house. Like:\n\n“You have a good work ethic.”\n\n“You are a loyal friend.”\n\n“You have a beautiful smile.”\n\nYes, they felt like lies after listening to self-hatred for so long, but perseverance made the difference.\n\nAt some point, I had a moment. A realization.\n\nSometimes we go through things and feel like we do not have the strength to make it through.\n\n“This is how I go out,” was often a phrase I have uttered to myself in defeat. It is easy to focus on the negative and let ourselves be overwhelmed. That is why reflection is so important.\n\nThe beauty of it is that if we can push through, the current struggle will shrink behind us like a bend in the road.\n\nEverything we endure serves to make us stronger and much more fit to face the next challenge.\n\nCurrently, I am experiencing some things that would have crushed the old me. Obstacles I have never faced before. People have repeatedly asked if I am all right.\n\n“I will be,” is a favorite response of mine. It signifies faith and the belief that things are not static. Things always change.\n\nSure, I get sad sometimes, but giving up is out of the question. I am constantly reminded of the saying:\n\n“I did not come this far to only come this far.” ~Matthew Reilly\n\nHope is a beacon I keep burning in my soul. I feed it daily, and it illuminates an otherwise deep darkness.\n\nI had to go through all of that to be strong enough for right now. All of this—the waiting, the sleepless nights, the hard work—it is all going to be another bend in the road. A story to share. It is muscle to climb the next hill.\n\nI guess you could say I am owning this struggle. Walking through hell like I own the place.\n\nWhen new stressors and worries come up, I put them in the pile of things I can not do anything about. If so-called obligations arise, I am at liberty to decline for my peace of mind.\n\nWhen good news comes around, it is a glimmer of light. Daylight piercing through the other end of my dark tunnel.\n\nIt combines with the light of hope inside and urges me onward and upward. I am expectantly moving toward it and looking for the next stage in my journey.\n\nAs a final thought, those tough experiences made it possible for me to help and encourage people today.\n\nThere were times that I thought no good could possibly come from the pain. Looking back though, I feel only gratitude. I am grateful for myself for persevering, for the professionals that helped me, and for my support people that listened.\n\nIf you are facing something difficult, own it in the knowledge that you will get through it. One day you will look back on it and smile.\n\nLive it.\n\nFeel it.\n\nOwn it.\n\nOvercome it.",
            "display":"/images/hope.png",
            "image": "/images/starDavis.png",
            "author": "Star Davis",
            "aboutAuthor":"Star Davis has a background of 10+ years in the medical field and a deep love for writing. In community college, she started writing short pieces and documenting her mental health journey. Several years later, she feels she is in a place where she can share what she has been through. She launched a blog in December of 2023 where she posts weekly sourced articles. She also writes inspirational poetry and positively themed short stories.  You can find her at starpdavis.com.",
            "id": 1
        },
        {
            "title": "How To Keep Yourself Motivated When You are Not Feeling It",
            "body": "“A diamond is just a piece of charcoal that handled stress exceptionally well.” ~Unknown\n\nI am great with short-term goals. In fact, I prefer them. Work my butt off for a few months to reach a goal? I am down with that. I will give up a social life, down time, spending money, eating yummy food (read: sugar), drinking alcohol—whatever it takes, for the short-term. Long-term goals… ugh, not so much.\n\nDespite this preference for pretty immediate gratification, I have followed through with many long-term goals in my life (school and various trainings, long-distance relationships, starting and re-starting businesses, to name a few).\n\nThere have also been quite a few of these goals that I have dropped that I wished I had not.\n\nI, like many of us, have noticed a pattern of finding it much more difficult to stay engaged once the initial excitement of starting something new has worn off.\n\nThrough this learning process of motivating myself to follow through with longer-view goals, I have come up with a few steps that have really helped me to stay focused and on track. Here are three steps that can help.\n\nRemind yourself that you are in charge.\nThere are loads of reasons we get off track with goals. Self-doubt, fear we woould not succeed, and concern that we are not setting realistic goals are just a few of them.\n\nThis is really important to remember: You can change this goal if you want. You can keep going, you can revise it, or you can dump it altogether.\n\nWhen we are experiencing doubts, it is easy to feel like we have no power; it is easy to feel like we do not have a choice. However, most often, we do.\n\nI find it helps to simply remind myself that I am in charge. Many times, when the going gets tough, we begin to feel like the choices we made (sometimes long ago) are not our own. Sometimes a reminder to ourselves that we are the ones who originally set this goal is a good way to rev the engine.\n\nWhen I first started acupuncture school, I was pretty young, but it had been several years since I would been in school. I would been living on my own, partying it up, and doing whatever I liked.\n\nI saw pretty quickly that I had to get serious, stop staying out late so often, and learn to organize my time and resources far better than I had been. In short, I had to get productive.\n\nWell, the meltdown that ensued was not very attractive. I did not want to give up my young, single, and independent lifestyle! I did not want to trade late nights with my friends for late nights with textbooks and manuals!\n\nThat went on for about a week, until a wise friend (who was tired of my whining), said, basically, “You wanted this. Get with it, or quit school.”\n\nIt was the kick in the butt I needed to stop complaining and remember that I did want it. I was very driven to be an acupuncturist, because it is an amazing modality. And I strongly desired (and continue to desire) to live a life of service.\n\nI woould not say it was completely smooth sailing from there on out, but my productivity and focus were certainly much improved.\n\nLook back at all you have already achieved.\nIf you have been taking steps towards your goal for a while, then it can be great to take some time to consider all that you have already accomplished. All long haul goals take multiple, incremental steps to attain. Pat yourself on the back, and remind yourself of these achievements.\n\nThe thing is, once an incremental step is attained, it can quickly feel like not quite so big of a deal. It becomes commonplace, and it is not as exciting as it was when we first accomplished it. That is normal, and understandable, and it is great to look back occasionally and remind ourselves what a big deal reaching that step really was at the time.\n\nWhen I am frustrated about what feels like a lack of movement toward a goal, I sit down and make a list of the steps I have already enacted to reach it, and what the results of those steps have been. I am almost always surprised at how much I have produced. This clarity helps in releasing those feelings of frustration.\n\nExplore the reasons you are going for this goal and remind yourself often.\nWhile I was in school, there were many times when I simply wanted to quit.\n\nI had student loans (that were growing!). As I mentioned, there was little time for a social and personal life. I was learning a technique that required a very different perspective (energy medicine vs. the physical body) than I had previously.\n\nBesides that, I was starting to sweat the idea of running my own business. Would I fail? Could I make it work? Maybe I was nuts to think I could succeed at this at all!\n\nWhen I would start to get too caught up in all that noise, I would literally sit down and remind myself of the reasons I would chosen the path I had.\n\nI loved acupuncture; despite fear about being self-employed, I craved that independence; I resonated strongly with the concepts of energy I was learning, even if the vocabulary was new.\n\nTaking the time to have these talks with myself helped to re-invigorate me, to renew my focus, and encouraged me to continue.\n\nTo really follow through with a longer-term goal, we have to have solid reasons that make sense to us.\n\nThat said, goals are not set in stone. Like everything in life, it is good to approach them with flexibility and open-mindedness.\n\nIf you can not successfully remind yourself of your initial reasons for going for the goal, and get re-ignited about those reasons, then it might be time to re-assess.\n\nOnly we can decide what is best for us, and that can change over time. It is so important to give ourselves permission to go for goals with full-on focus and gusto, or to change them, or put them aside for a while, or whatever else we decide is right at that time.\n\nWhat techniques do you use to keep yourself motivated on your goal-getting journey?",
            "display":"/images/motivating.jpeg",
            "image":"/images/mariaMoraca.png",
            "author":"Maria Moraca",
            "aboutAuthor":"Maria Moraca is a conscious integrated channeler. She and Zurac (her “entity dude”) work in tandem; Maria encourages empowerment and Zurac offers insight and clarification to life path questions. Her website and blog are at mariachanneling.com.",
            "id":2
        },
        {
            "title": "15 THINGS I USE TO MANAGE MY MENTAL HEALTH",
            "body": "1 : CREATING A SCHEDULE:\n\nSometimes my mental health is worsened when I feel out of control, it’s as if my life is unravelling and I have no idea how to cling on or how to keep it all together.\nSetting myself a schedule that is completely manageable helps me all the time but especially on days where my depression and anxiety are at its worst.\nIf I do not set a schedule, my mind turns into jelly and it wobbles ALL OVER the place.\nI imagine a massive list of things that I cannot get done in a single day and then I do not want to do anything.\nSo I schedule one to two important tasks a day (this is crucial for me as I also work from home but it also works for housework, self-care, anything you want to get done) and it is easier for me to do them and when I tick them off it is a huge achievement.\nI think having a routine in place also helps my mental health in more ways than one, it helps me get a better sleep at night and ensures that I eat proper meals and I make time for me!\n\n2 : MUSIC:\n\nSpotify is my best friend. I could not live without it.\n\nI listen to music first thing in the morning, it helps me get out of bed.\n\nPreferably uplifting music that makes me dance my way into the shower and gets me in a good mood. Music is also there for me when I am anxious, as it can calm me down but I also listen to music when I am cooking, doing housework, editing my photos, exercising or walking outdoors.\n\n3 : READINGS BLOGS / BOOKS:\n\nReading other success stories, tips and even just things I can relate to often helps me with my own mental health. I love to read blogs and self-help books – here is a few of my favorites at the moment:\nThe Anxiety Solution: A Quieter Mind, a Calmer You\n\nHardcore Self Help: F**k Anxiety: Volume 1\n\nModern Day Girl\n\nFiona Likes To Blog\n\n4 : SELF-CARE:\n\nLife gets a bit much sometimes and having a lot on my plate can be stressful on my mental health, especially if I have a lot to be anxious about. Being a Wedding Photographer means that Summer can be extremely stressful on my anxiety, I get anxious before every wedding, so having lots of them to photograph in a short period of time is draining mentally. It is times like that, that self-care is majorly important. My favorite things to do when practicing self-care are having a nice hot bath, relaxing to music, eating copious amounts of Dairy Milk Giant Buttons and watching a good box-set under my duvet.\n\n5 : REFLECTION:\n\nWhen my mental health is in a bad way or I feel myself slipping back into anxious/negative thoughts, I like to gently remind myself of the things I have managed to accomplish despite all the obstacles that have been in my way.Reflecting on positive things that I have done helps to establish a belief that I can do it again, or I can get through anything.\n\n6 : SUPPLEMENTS:\n\nI use a mixture of supplements to give me energy and often improve my mood if need be.My favorite supplement is the Life Extension – Vitamin D3, 1000IU, 250 capsules as I work mostly from home, which means I do not get a lot of exposure to the sun and, well, living in the UK means I do not get much of that when I am out of the house either! Vitamin D supplements just give me that boost of energy that I need to help both my mental health and my chronic illness. I have also recently started taking 5-HTP for my mood and that has been a really big help, I could feel myself slipping back into a depression and these really helped me crawl back out of it.\n\n7 : ALTERNATIVE THOUGHTS:\n\nWhen I am having an anxiety attack or feeling close to one, it is important to me to have those alternative thoughts ready to counteract any horribly shit thoughts I am having. Like turning “oh shit, I am gonna fuck everything up” into “It will be okay, you have managed to get through situations like this before, you can do this!” or turning “everyone is staring at me” into “no one is concerned about you, people are not looking at you”. I talk quite a bit about how to direct your negative thoughts into positive ones in my new book here.\n\n8 : SETTING GOALS:\n\nI have a list of goals that I like to tick off, I do not always set a date for them and bigger goals I like to break down into smaller pieces so they are easier to achieve. I feel like having something to work towards makes me more productive, gives my life a bit more purpose and stops me from feeling out of control and lost. It also helps me to push through my anxiety in situations that involve reaching my goals. I have them listed on a Word document, I simply put a strike-through the text when I have completed the goal.\n\n9 : TALKING ABOUT IT:\n\nTalking about my mental health has helped me in ways I never thought it could. I do not just mean talking to my friends and family and people who know me in real life but also talking to strangers on the internet, like you lovely sods! It has been incredible to find a network of people who understand what I am going through but also it has been comforting and also eye-opening to hear other people’s perspectives on their mental health. I definitely recommend talking to people about your mental health. Here is some resources of mine that may help:\n\nMy Facebook Group for people with Anxiety – It is a closed group so no one outside the group can see your posts.\n\nHow To Explain Social Anxiety To Someone Who Does not Have It – My most requested post and now one of my most popular posts.\n\n10 : NATURE:\n\nWalking in the forest, the smell of pine trees, the sounds of the birds, watching the sun dance on the lake, hearing the waves crash… all of those things improve my mental health greatly. It is amazing how different I feel just spending even a few minutes in nature. I also love stargazing and often take my camera out to capture the stars, that definitely makes me feel something that books, supplements and self-care cannot. My fears feel so much smaller when I look up at the sky and see all of those stars.\n\n11 : LETTING IT ALL OUT:\n\nSometimes it is good to just have a good cry and punch a fucking pillow. The worst thing I have ever done for my mental health is bottle everything up and keep it all inside. I ended up worse off than I was before, because it all built up and I ended up having a breakdown. Just get it out. Cry about it, think about it for a bit, tell someone how you feel, anything to get it out there before it becomes a burden you cannot bear. It is important to acknowledge what you are feeling, rather than sweeping it under the carpet.\n\n12 : BEING CREATIVE:\n\nPhotography saved my life in a way.I had just been diagnosed with a Social Anxiety Disorder, just dropped out of school, could not ever leave the house but photography helped me do things I was too anxious to do before.Slowly, it helped me leave the house, it helped me meet new people and learn conversational skills, it helped put me on the spot and learn how to cope with that, it gave me a job when I had no qualifications. It was my biggest passion and I think that passion gave me enough drive to get through the worst of things.Not only has my creativity with photography helped me with accomplishing things in life despite my social anxiety, my creativity in general helps me to focus on something I enjoy.I love writing, crafting things for my photo shoots and I also do a little horror photography on the side of my photo business to keep my creative spark alive.\n\n13 : EXERCISE:\nI have only just started getting back into this since my recent surgery for Endometriosis but exercise has always been amazing for my mental health.I used to love running in the forest or by the river and now that I live in Somerset, there are lots of country walks for me to go on. It is not just the natural endorphins that are released when you exercise that I find good for my mental health but also the feeling of being strong and feeling of accomplishment as well.\n\n14 : CUTTING DOWN ON SOCIAL MEDIA:\n\nSocial media messes with my head so much that when I am particularly delicate, I need to cut down.I have to step away from my phone for a while and just be present, or I end up feeling incredibly low and incredibly anxious. There are lots of reasons why social media makes me feel this way and perhaps you can relate but these are the main reasons for me:I end up comparing myself to everyone, on Facebook and Instagram especially.It lowers my self-esteem drastically. All the posts about bad news and terrible things happening that are out of my control make me feel useless and severely anxious.It sometimes becomes an obsession to be perfect on social media and have likes etc.Seeing other people have things I cannot have, like when I had a miscarriage and having to see everyone’s pregnancy announcements and baby statuses or when my social anxiety was extremely severe and having to see my friends going out without me having a good time.\n\n15 : WRITING ABOUT IT:\n\nOf course this had to be on the list!Writing my blog has opened up a whole new world for me, in a sense that I get therapeutic value from writing about my mental health on a frequent basis but I also get to talk to lots of people who are going through the same thing.It has also opened up other doors such as being on the radio for BBC Radio 5 Live, which was a massive challenge for my social anxiety disorder.",
            "display":"/images/yoga.jpg",
            "image":"/images/15.png",
            "author": "Kelly Jean",
            "aboutAuthor": "Kel, a lifestyle and mental health blogger, living in Somerset with my partner and twin boys. By day I am a professional photographer and by night I blog about managing anxiety, depression, having a chronic illness and many other things.",
            "id": 3
        },
        
        {
            "title": "The Importance of Self-Care",
            "body": "The importance of Self-care means taking care of yourself, including your physical, mental, emotional, and social needs. Self-care is necessary for overcoming obstacles and stress in everyday life as well as for maintaining health. We spend most of our time focusing on our work, family, and other obligations. Most of us usually neglect to care for ourselves. But self-care is the most important thing in our daily lives, and it should always be a top priority.\n\nWell, let’s take a look at why self-care should be a priority in our lifestyle.\n\nThe very first reason is that self-care can help reduce stress. In today’s world, we are surrounded by things that stress our mind and body. If you do not take care of yourself for a long time, you could develop depression before you realize it. This can also cause physical and mental exhaustion, making it difficult to perform tasks normally in our daily lives. By taking some time to take care of yourself, you can reduce stress levels and feel more focused and motivated, both at work and outside.\n\nSecondly, self-care is essential for our health. Self-care involves eating a healthy diet, exercising regularly, and getting adequate sleep. This way, you are able to prevent chronic diseases such as diabetes, heart disease, and obesity. If you have a healthy body, you feel more confident, happy, and relaxed. That is why self-care can also improve your mental health. In addition, self-care also involves anything from reading a book, doing yoga, or practicing meditation to spending time with family and friends. These activities can make us feel more satisfied and joyful, which can improve our mental health overall.\n\nWhy You Should Make It a Priority in Your Lifestyle?\n\nSelf-care, on the other hand, can help us create better relationships with others. When we take care of ourselves, we are better able to deal with the challenges of everyday life. This can improve our patience, understanding, and compassion for others. We can set an example for others around us by taking care of ourselves, encouraging them to prioritize their own self-care. By learning to love and care for yourself, you can develop stronger and more fulfilling relationships with others.\n\nFinally, self-care is essential for your personal growth. Personal growth and development are the most significant reasons to prioritize self-care. We can focus on and accomplish our life objectives and aspirations by taking time to care for ourselves. We may improve our self-awareness and confidence by investing in our own personal growth and development.\n\nIn conclusion, the importance of self-care is the key to achieving a happy and healthy life. You should prioritize self-care in your lifestyle since it can reduce stress and prevent burnout, improve our physical and mental health, stimulate personal growth and development, and improve our relationships with others. Self-care is not a selfish act. It’s difficult to take care of yourself, and you often forget to do so in practice. If you have forgotten to love and take care of yourself, let’s use the remaining time of our lives to love ourselves more.",
            "display":"/images/selfCare.jpeg",
            "image":"/images/selfcare.jpg",
            "author": "By Nyi Thura",
            "aboutAuthor": "Creative content writer with strong writing, marketing, and research abilities. I enjoy trying new things and I am always eager to learn new skills and knowledge.",
            "id": 4
        },
        {
            "title": "There’s No Shame In Medication",
            "body": "There’s a certain amount of stigma surrounding mental health in general, but there is further stigma when it comes to psychiatric medication.\n\n“They turn you into a zombie”\n“They take away who you really are”\n“You won’t be the same”\n\nThese are just some of the phrases you might hear in regards to medications such as antidepressants. It’s not just psychiatric medication either. People tend to accept taking medication for things like diabetes or infections, but the minute opioid painkillers come into play, those misconceptions and stigma soon come into play. I am not denying that sometimes medication can be overprescribed, but people fail to realize just how vital they are to many of us and that they do not change who we are.\n\nIt’s funny when I think about a few years back. I was struggling and considering whether to allow my doctors to put me on antidepressants. I was unsure because there’s a popular misconception that it zones you out and changes you, but after researching I saw that this generally seemed to be a myth. There were side effects, but they usually subsided after a few weeks.\n\nAt first though, the misconceptions about antidepressants almost prevented me from accepting them. I did eventually agree to take them and though I was very tired at first, it did not change me or turn me into an extra from the walking dead.\n\nIt’s funny looking back at how I was hesitant to go on antidepressants, considering now I have tried and been through a long list of medication and currently take two different types of antidepressants, an antipsychotic medication, and dihydrocodeine, an opioid painkiller.\n\nWorry about being overmedicated left me a long time ago, but I still get concerned or shocked looks when I mention my medication, but I need it. I struggle a lot with my physical and mental health, but I would not be able to function at all without them.\n\nMental Health\n\nI have struggled with my mental health for years. I have experienced many symptoms such as mood swings, anxiety, intrusive thoughts, dissociation, paranoia, self-harm, impulsivity, attachment issues, to name a few. When I was 18, I finally received some answers and I was diagnosed with OCD, severe depression, panic disorder, and social phobia. I had already tried a couple of different antidepressants at this point, but my dose was raised. I had CBT and ERP therapy for my OCD which did wonders. I have been in recovery from OCD and panic disorder since. However, my other problems remained and my therapist referred me to as an outpatient to a local psychiatric hospital. It took a while of being passed round from pillow to post, but I eventually got diagnosed with Borderline Personality Disorder and I was put on Quetiapine (an antipsychotic) for the paranoia I was experiencing. I have been on Quetiapine for a short time, but my dose will gradually be raised. My psychiatrist decided to put me on it with hopes that it could help my insomnia, stabilize my mood and paranoia. It is still early days, but my paranoia has subsided somewhat.\n\nPhysical Health\n\nI have always experienced pain. When I was a young child, I often complained about pain in my legs. My mum had Perthes as a child, so my doctor was concerned I had too. After tests though, they said I did not have it and there was no obvious reason for my pain and passed it off as growing pains.\n\nHowever, my pain did not go away with age. Throughout the years, I have gone to my GP with various pain. Pain in my back, my chest, my legs; and I was always given some vague answer that basically meant they could not find a problem, so they were not going to do anything about it.\n\nThings got worse when I was 18. My pain got worse and so did my fatigue. When I was 19, I started going to the gym to try and improve my fitness and as a coping mechanism, but going to the gym was the beginning of my chronic illness deteriorating to point of debilitating me completely. The pain became unbearable. I would walk for five minutes and be in tears. My fatigue was so severe it was hard to even hold my head up half the time. I was constantly having dizzy spells and my life was deeply affected. I could not go to uni, I could not work, could not socialize.\n\nI went back to my GP who referred me to a rheumatologist. I was diagnosed with Fibromyalgia and ME. I was referred to physio and put on co-codamol. They did not work and I was tried on others. I was put on gabapentin, pregabalin, to name a few. I also tried tramadol, but that combined with my antidepressants meant I had too much serotonin and I ended up going to the hospital. I was fine, but I had to stop taking them. I was given buprenorphine which helped the pain, but it caused a skin allergy so, again I had to stop.\n\nI am not going to pretend my journey with medication for my health has been perfect. I have had bad reactions that have left extremely drowsy, but eventually I have found medication that I am okay with and it is vital to my life. I currently take dihydrocodeine and amitriptyline which is an antidepressant, but also is shown to be useful to help nighttime pain.\n\nI do not get any bad reaction and it means that most days I can get out of bed even if it is just to go downstairs. I still cannot do what I would like to, like study or work, but at least it provides some release.\n\nThere is a lot of fear around opioid painkillers due to addiction. They can be highly addictive, however if you stick to the regime your doctor prescribes, you can be on them without being addicted. There is a difference between dependency and addiction. I do depend on them, but I am not Physically addicted.\n\nI know some people would judge me based on the medication I take. I know some people would tell me I should not take the medicine I do and that I am too young. However, I do not care. My medication helps me to get by and I am not going to apologize for that. I am not saying medication is for everyone or that there is never any side effects.\n\nHowever, what I am saying is that there is nothing wrong with having to rely on medication to help you with an illness.\n\nI am still me.\n\nI have the same personality traits and beliefs. My medication has not changed me.\n\nWhat it does, is allow me be able to get out of bed more often. It helps stop me from being paranoid and helps me to be a little more functional. So I will continue to take it.\n\nThere is no shame in taking medication. There is nothing weak about having to take it for an illness and we need to remove the misconceptions around medication. There is no shame in medication.\n",
            "display":"client/public/images/medShame.jpg",
            "image":"/images/meds.jpg",
            "author": "Lydia",
            "aboutAuthor": "A 25 year old woman from the UK and my name is Lydia. I am obsessed with makeup and drag queens. My entire life revolves around my mum and my little dog, Alfie. My life is limited by my mental health and my Fibromyalgia. I cannot do a lot of what I would like to do. However, when I can, I love to volunteer for a local mental health charity. When I cannot do much, I enjoy nothing more than wrapping myself in blankets and binging episodes of RuPaul’s Drag Race or watching Grey’s Anatomy with my mum. I love TV, books, and the internet. They are great friends when you have a chronic illness that limits your physical capabilities. I also love makeup and creating looks. I am passionate about a lot of things and I love to write, which is why I started this blog. I hope you enjoy it.",
            "id": 5
        }
        
    ],
    "books":[
        {
            "title": "Man's Search for Meaning",
            "author": "Viktor E. Frankl",
            "display":"/images/victor.jpg",
            "plot": "His classic explores Frankl's experiences as a Holocaust survivor and a psychiatrist. He delves into the importance of finding meaning in life, even amidst suffering, and how this can contribute to mental resilience.\n\n- When the going gets tough, tough get going. (This proverb strictly fixates on his situation)\n\n- Hope is the good thing, maybe the best of things and no good thing ever dies — Andy Dufresne (from the movie Shawshank Redemption).\n\n- Sufferings have purpose, keep fighting.\n\n- He who has a why to live, can bear with almost anyhow — Friedrich Nietzsche.\n\n- Keep yourself busy to avoid existential vacuum.\n\n- Practice gratitude.\n\n- Be a peculiar observer.\n\n- Do not complain, search for solutions, implement.\n\n- Love is recognizing one's potential and helping them up in increasing it.\n\n- Circumstances are not in your hand, but your attitude towards it is.",
            "aboutAuthor":"Viktor E. Frankl (1905–1997) was an Austrian neurologist, psychiatrist, Holocaust survivor, and the founder of logotherapy, a form of existential analysis. He was born in Vienna and experienced firsthand the horrors of the Holocaust, spending three years in Nazi concentration camps, including Auschwitz and Dachau. Frankl's experiences in the concentration camps deeply influenced his understanding of human psychology and the search for meaning in life. Despite enduring unimaginable suffering and loss, he observed that those who found purpose and meaning were more likely to survive. In addition to 'Man's Search for Meaning,' Frankl wrote numerous other books and essays on topics related to psychology, existentialism, and the human search for meaning. He also traveled extensively, lecturing and teaching around the world until his death in 1997. His legacy continues to inspire people to find purpose and meaning in their lives, even in the face of adversity.",
            "image": "/images/meaning.jpg",
            "id": 1
        }
        
        ,
        {
            "title":"The Power of Now",
            "author":"Eckhart Tolle",
            "display":"/images/eckhart.jpg",
            "plot":"Tolle's book emphasizes the importance of living in the present moment to achieve inner peace and mental clarity. He discusses techniques for quieting the mind and overcoming negative thought patterns. \n\n- Lesson 1: All life is is a series of present moments \n\n- Lesson 2: Any pain you feel results from resisting the things you can’t change.\n\n- Lesson 3: You can free yourself from pain by constantly observing your mind and not judging your thoughts.",
            "aboutAuthor":"Tolle experienced a profound spiritual awakening at the age of 29 after suffering from long periods of depression. This awakening marked a significant turning point in his life, leading him to dedicate himself to understanding the nature of consciousness and the human mind. Tolle's teachings emphasize the importance of being fully present in the moment, letting go of negative thought patterns, and cultivating a deep sense of awareness and acceptance. He draws on insights from various spiritual traditions, including Buddhism, Taoism, and Christianity, to offer a universal message of inner peace and spiritual awakening. In addition to writing books, Eckhart Tolle travels extensively, giving lectures, seminars, and retreats around the world. He has also appeared on television and radio programs, sharing his teachings with a wide audience. Tolle's work continues to inspire millions of people to live more mindfully and to find greater fulfillment and peace in their lives.",
            "image":"/images/now.jpg",
            "id":2
        },
        {
            "title":"The Bell Jar",
            "author":"Sylvia Plath",
            "display":"/images/sylvia.jpeg",
            "plot":"Plath's semi-autobiographical novel offers a raw and honest portrayal of mental illness, particularly depression. Through the protagonist's experiences, readers gain insight into the challenges of navigating mental health issues and societal expectations. The Bell Jar follows Esther Greenwood, a college student, during a summer internship in New York City where she grapples with identity and societal norms. She meets contrasting figures like rebellious Doreen and wholesome Betsy, reflecting her internal conflicts. Esther struggles with her boyfriend's hypocrisy and experiences rejection, leading to despondency and suicide attempts. After overdosing, she is admitted to a mental institute where she undergoes treatment, including electric-shock therapy. Esther loses her virginity and faces mortality when another patient commits suicide, ultimately finding a newfound sense of liberation and resilience.",
            "aboutAuthor":"Sylvia Plath (1932–1963) was an American poet, novelist, and short-story writer, best known for her confessional style of writing and her exploration of themes such as death, mental illness, and the struggle for identity. Plath was born in Boston, Massachusetts, and grew up in a family that encouraged her literary pursuits. Plath's early life was marked by academic success and literary ambition. She attended Smith College on a scholarship and later won a Fulbright scholarship to study at Newnham College, Cambridge, in England. It was during her time at Cambridge that Plath experienced a deep depression and made her first suicide attempt, which she later described in her semi-autobiographical novel, 'The Bell Jar'.Plath's work has had a lasting impact on literature and continues to be studied and admired for its intensity and honesty. Despite her relatively short life, Plath left behind a significant body of work that continues to resonate with readers around the world. She is often regarded as one of the most important poets of the 20th century.",
            "image":"/images/jar.jpg",
            "id":3
        },
        {
            "title":"Feeling Good: The New Mood Therapy",
            "author":"David D. Burns",
            "display":"/images/david.jpg",
            "plot":"This self-help book provides practical strategies based on cognitive-behavioral therapy (CBT) for managing depression and anxiety. Burns introduces readers to cognitive distortions and offers techniques for challenging negative thinking patterns. The book emphasizes the connection between thoughts and moods, encouraging readers to challenge negative thought patterns. Burns identifies common cognitive distortions and provides exercises to help readers recognize and challenge them. Techniques such as the Disarming Technique, Double-Standard Technique, and Semantic Technique are introduced to reframe negative thoughts and promote self-compassion.",
            "aboutAuthor":"David D. Burns is an American psychiatrist, author, and researcher best known for his work in cognitive behavioral therapy (CBT) and his influential book 'Feeling Good: The New Mood Therapy.' Born in 1942, Burns earned his medical degree from the Stanford University School of Medicine. Burns gained prominence in the field of psychology with the publication of 'Feeling Good' in 1980. The book became a bestseller and is widely regarded as a seminal work in the self-help genre. In 'Feeling Good,' Burns presents techniques and exercises based on CBT principles to help readers overcome depression and improve their mental well-being.In addition to his writing, Burns has served as a professor emeritus in the Department of Psychiatry and Behavioral Sciences at the Stanford University School of Medicine. He has also conducted workshops and training sessions for mental health professionals around the world, helping to disseminate CBT techniques and principles.",
            "image":"client/public/images/good.jpg",
            "id":4
        },
        {
            "title": "The Noonday Demon: An Atlas of Depression",
            "author": "Andrew Solomon",
            "display":"/images/andrew.jpg",
            "plot": "Solomon's comprehensive exploration of depression combines personal anecdotes, scientific research, and cultural analysis. He examines the complexities of depression and its impact on individuals and society. Through introspective reflections and meticulous research, Solomon delves into the intricate interplay between depression, love, and identity. By sharing his own journey with depression and exploring various treatment modalities, Solomon offers hope and validation to readers grappling with similar struggles. His exploration of topics like addiction and suicide adds depth to our understanding of the complexities surrounding mental health. Ultimately, 'The Noonday Demon' serves as a poignant reminder of the resilience of the human spirit in the face of profound darkness.",
            "aboutAuthor":"Andrew Solomon is an American writer, lecturer, and professor of clinical psychology at Columbia University. He was born on October 30, 1963, in New York City. Solomon is best known for his award-winning book 'The Noonday Demon: An Atlas of Depression,' published in 2001, which explores his personal experience with depression as well as the broader cultural, medical, and social aspects of the condition.Solomon's writing often delves into complex issues surrounding identity, psychology, and human resilience. He is also known for his book 'Far from the Tree: Parents, Children and the Search for Identity' (2012), which examines the experiences of parents raising children with various forms of difference, including autism, Down syndrome, and schizophrenia. This book won the National Book Critics Circle Award for Nonfiction and was adapted into a documentary film.",
            "image": "/images/noon_.jpg",
            "id": 5
          }
    ]
}
